---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnector
source: html/f218eb33-79c4-5603-5e79-bd94592b8eed.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.InvalidConnector Property

The connector is invalid, the size cannot be determined from the connector.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidConnector { get; }
```